# **Q 01**
Find the sum of longitudes and latitudes rounded to 2 decimal places. [Link](https://www.hackerrank.com/challenges/weather-observation-station-2/problem?isFullScreen=true)

**Solution:**
``` sql
SELECT round(sum(lat_n),2), round(sum(long_w),2) FROM Station;
```
<hr>

# **Q 02**
Finding the Manhattan distance between min and mix longitude and latitude points. [Link](https://www.hackerrank.com/challenges/weather-observation-station-18/problem?isFullScreen=true)

Using the concept of variable in SQL.
**Solution:**
``` sql
SET @a:= (SELECT min(lat_n) FROM station);
SET @b:= (SELECT min(long_w) FROM station);
SET @c:= (SELECT max(lat_n) FROM station);
SET @d:= (SELECT max(long_w) FROM station);
SELECT round(ABS((@a-@c) + (@b-@d)),4);
```
<hr>

# **Q 03**
Finding all the population of cities in Asia (city and continent tables) [Link](https://www.hackerrank.com/challenges/asian-population/problem?isFullScreen=true)  
JOINs  
**Solution:**
``` sql
SELECT SUM(ct.population) FROM city as ct
JOIN country cn
ON cn.code = ct.countrycode
WHERE cn.continent = "Asia";
```
<hr>

# **Q 04**
Generating report of student with grades [Link](https://www.hackerrank.com/challenges/the-report/problem?isFullScreen=true)

Joining tables other than just the equal sign, Order by multiple columns.
**Solution1:**
``` sql
SELECT s.name,g.grade, s.marks  FROM students s
JOIN grades g
ON s.marks >= g.min_mark and s.marks <= g.max_mark
WHERE g.grade >= 8
ORDER BY g.grade DESC, s.name ASC;

SELECT 'NULL', g.grade, s.marks FROM students s
JOIN grades g
ON s.marks >= g.min_mark and s.marks <= g.max_mark
WHERE g.grade < 8
ORDER BY g.grade DESC, s.marks ;
```
<hr>

Using the IF() function in SQL.  
**Solution2:**
``` sql
SELECT 
    IF(g.grade >= 8, s.name, 'NULL') AS Name,
    g.grade AS Grade,
    s.marks AS Mark
FROM 
    Students s
JOIN 
    Grades g ON s.marks >= g.min_mark AND s.marks <= g.max_mark
ORDER BY 
    g.grade DESC,
    IF(g.grade >= 8, s.name, NULL), -- Order by name alphabetically for grades 8-10
    IF(g.grade < 8, s.marks, NULL); -- Order by marks ascending for grades 1-7

```
<hr>